[
{
"text":"Программирование на С похоже на быстрые танцы на только что отполированном полу людей с острыми бритвами в руках."
},
{
"text":"Хороший программист всегда смотрит и направо, и налево прежде чем перейти улицу с односторонним движением."
},
{
"text":"Большинство из вас знают достоинства программистов. Их, конечно же, три: лень, нетерпеливость и высокомерие."
},
{
"text":"Всегда пиши код так, как будто человек, который будет его саппортить — психопат-убийца, который знает, где ты живешь."
},
{
"text":"В теории, теория и практика неразделимы. На практике это не так."
},
{
"text":"Иногда лучше остаться спать дома в понедельник, чем провести всю неделю в отладке написанного в понедельник кода."
},
{
"text":"Если сразу не получилось хорошо, назовите это версией 1.0."
},
{
"text":"Когда создадут язык программирования, который позволит программистам писать код на английском языке, выяснится, что они не знают английского."
},
{
  "text":"Программирование — как секс. Одна ошибка, и ты должен поддерживать его до конца жизни."
},
{
"text":"Первые 90% кода занимают первые 90% времени на разработку… Оставшиеся 10% кода занимают еще 90% времени на разработку."
},
{
"text":"Отладка кода вдвое сложнее, чем его написание. Так что если вы пишете код настолько умно, насколько можете, то вы по определению недостаточно сообразительны, чтобы его отлаживать."
},
{
"text":"Меня не интересует, будет ли это работаеть на ваших машинах! Мы не отдаем их заказчику!"
},
{
"text":"Комментировать свой код — как убирать в туалете. Никогда не хочется это делать, но это реально важно для создания приятного опыта у ваших гостей."
},
{
"text":"Самая сложная часть в дизайне… держаться подальше от фич."
},
{
"text":"Чтобы понять рекурсию, нужно сперва понять рекурсию."
},
{
"text":"Есть два типа языков программирования: те, которые люди постоянно ругают, и те, которыми никто не пользуется."
},
{
"text":"Если бы в Java была реализована уборка мусора, большинство программ удаляли бы себя сразу после запуска."
},
{
"text":"Легче что-то померить, чем понять, что ты только что померил."
},
{
"text":"Java относится к JavaScript так же, как Сом к Сомали."
},
{
"text":"У компьютеров хорошо получается выполнять инструкции, а не читать ваши мысли."
},
{
"text":"Если отладка — это процесс удаления багов из кода, то получается, что программирование — это процесс помещения их туда."
},
{
"text":"Это не баг — это незадокументированная фича."
},
{
"text":"Софт проходит бета-тестирование незадолго до того, как выходит в свет. Бета на латыни означает «все еще не работает»."
},
{
"text":"Отладка кода — это как охота. Охота на баги."
},
{
"text":"Если бы строители работали так же, как программисты кодят, то любая птица, присевшая отдохнуть на крыше дома, могла бы стать причиной гибели цивилизации."
},
{
"text":"Пока компьютеры не умеют мыслить самостоятельно, им можно доверять."
},
{
"text":"Задумайтесь, какое количество психических сил затрачено программистами на попытки понять фундаментальное различие между программой и алгоритмом!"
},
{
"text":"Если никто не знает ответ на вопрос, пора начать читать документацию."
},
{
"text":"Самое главное отличие C от C++: на Си вы можете делать ошибки, а в C++ — еще и наследовать их."
},
{
"text": "Не волнуйся, если не работает. Если бы все всегда работало, у тебя быне было работы."
},
{
"text": "Для каждой сложной задачи существует решение, которое является быстрым, простым и неправильным."
},
{
"text": "Тестирование не позволяет обнаружить такие ошибки, как создание не того приложения."
},
{
"text": "Я не умею делать скриншоты, потому что я обычно работаю на компьютере в текстовом режиме."
},
{
"text": "Преждевременная оптимизация — корень всех зол."
},
{
"text": "Насколько проще было бы писать программы, если бы не заказчики."
},
{
"text": "Java — это C++, из которого убрали все пистолеты, ножи и дубинки."
},
{
"text": "Работает? Не трогай."
}

]
  